# Pandas Data Structures

## Series

In [1]:
import pandas as pd

In [4]:
obj = pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4,7,-5,3], index=["d","b","a","c"])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2["a"]

-5

In [11]:
obj2[["c","a","d"]]

c    3
a   -5
d    4
dtype: int64

In [12]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [13]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [14]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
# Series can be thought as a fixed-length ordered dictionary. They can be created from dictionary also
sdata={'Ohio':35000, 'Texas':71000, "Oregon":16000, "Utah":5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# a series can be converted back to a dictionary:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [19]:
# you can pass an index along with the dictionary to decide the order of elements inserted in the series, 
# and which of them will appear. Missing index will be filled with NaN
states = ["California","Ohio","Oregon","Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [21]:
# Missing data (NaN) can be detected with the isna and notna functions
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj4[pd.isna(obj4)]

California   NaN
dtype: float64

In [23]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4[pd.notna(obj4)]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [25]:
# isna and notna are also available as instance methods:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [28]:
# series automatically aligns by index in arithmetic operations:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [30]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
# both the series object and the index has a name attribute that can be set:
obj4.name = "Population"
obj4.index.name = "State"
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: Population, dtype: float64

In [32]:
# series index can be altered inplace:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index=["a","b","c","d"]
obj

a    4
b    7
c   -5
d    3
dtype: int64

## DataFrame

DataFrame stores tabular data. Easiest way to built them is from a dictionary of equal length lists:

In [36]:
data = {
    "state": ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5,1.7,3.6,2.4,2.9,3.2]
}

frame = pd.DataFrame(data)

In [37]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
frame.head() # returns the first 5 rows

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
frame.tail() # return the last 5 rows

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
# if you specify a sequence of columns, the columns will be arranged in that order:
pd.DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
# if you specify columns that are not included in the data, they will be filled with NaN
frame2 = pd.DataFrame(data, columns=['year','state','pop',"debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [44]:
# columns can be retrieved as series in two ways:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [46]:
frame2.year # this work only if the column name is a valid python name, so no whitespaces or strange chars allowed in this case

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [49]:
# columns can be assigned:
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [51]:
frame2["debt"]=np.arange(6)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [58]:
# assigning a column that doesn't exist creates the column
frame2["eastern"] = frame2.state == "Ohio" # this can be only done assigning the column with [], not with the . notation
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5     0     True
1  2001    Ohio  1.7     1     True
2  2002    Ohio  3.6     2     True
3  2001  Nevada  2.4     3    False
4  2002  Nevada  2.9     4    False
5  2003  Nevada  3.2     5    False

In [59]:
del frame2["eastern"] # also here you must use the [] notation to select the column
frame2

   year   state  pop  debt
0  2000    Ohio  1.5     0
1  2001    Ohio  1.7     1
2  2002    Ohio  3.6     2
3  2001  Nevada  2.4     3
4  2002  Nevada  2.9     4
5  2003  Nevada  3.2     5

In [60]:
# another commonly used for is the nested dictionary notation:
populations = {"Ohio":{2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada":{2001: 2.4, 2002: 2.9}}

In [62]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [63]:
# DataFrame can be transposed with the .T operator
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [64]:
# index and columns can be named:
frame3.index.name= "Year"
frame3.columns.name= "State"
frame3

State  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [66]:
# the to_numpy method returns the data contained in the dataframe as a 2D array, 
# the dtype is chosen to accomodate all datatypes included
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, 0],
       [2001, 'Ohio', 1.7, 1],
       [2002, 'Ohio', 3.6, 2],
       [2001, 'Nevada', 2.4, 3],
       [2002, 'Nevada', 2.9, 4],
       [2003, 'Nevada', 3.2, 5]], dtype=object)

### Index Objects

In [67]:
obj = pd.Series(np.arange(3),index=['a','b','c'])

In [68]:
index = obj.index

In [69]:
index

Index(['a', 'b', 'c'], dtype='object')

In [70]:
index[1:]

Index(['b', 'c'], dtype='object')

In [71]:
# index are immutable:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [83]:
labels = pd.Index(np.arange(3,6))

In [84]:
labels

Int64Index([3, 4, 5], dtype='int64')

In [85]:
obj2 = pd.Series([1.5, -2.5, 0.], index=labels)
obj2

3    1.5
4   -2.5
5    0.0
dtype: float64

In [86]:
obj2.index is labels

True

In [87]:
frame3

State  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [88]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='State')

In [89]:
"Ohio" in  frame3.columns

True

In [90]:
2003 in frame.index

False

### Reindexing

In [91]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [92]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [93]:
obj2 = obj.reindex(['a','b','c','d','e']) # reindex rearrange data to match the new indeces and add NaN for missing indices

In [94]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [95]:
# reindexing allows to specify a method to fill in missing values. Useful to interpolate time series

In [97]:
obj3 = pd.Series(["blue",'red','yellow'], index=[0,2,4])
obj3

0      blue
2       red
4    yellow
dtype: object

In [98]:
obj3.reindex(np.arange(6), method="ffill") # forward fills method

0      blue
1      blue
2       red
3       red
4    yellow
5    yellow
dtype: object

In [102]:
# for dataframe reindex can alter the row index, the columns or both. If only a sequence is passed it affects the rows

frame = pd.DataFrame(np.arange(9).reshape((3,3)), index=["a","c","d"],columns= ["Ohio","Texas","California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [103]:
frame2 = frame.reindex(index=['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [104]:
states = ["Texas","Utah","California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping entries from an Axis

In [106]:
obj= pd.Series(np.arange(5.),index=["a","b","c","d","e",])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [110]:
new_obj = obj.drop("c") # operation is not inplace, so it generates a new series, without affecting the original one
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [111]:
obj.drop(["b","d"])

a    0.0
c    2.0
e    4.0
dtype: float64

In [112]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=["Ohio","Utah","Texas","California"],columns= ["a","b","c","d"] )
data

             a   b   c   d
Ohio         0   1   2   3
Utah         4   5   6   7
Texas        8   9  10  11
California  12  13  14  15

In [113]:
data.drop(index=["Ohio","Texas"])

             a   b   c   d
Utah         4   5   6   7
California  12  13  14  15

In [114]:
data.drop(columns=["b"])

             a   c   d
Ohio         0   2   3
Utah         4   6   7
Texas        8  10  11
California  12  14  15

In [115]:
# can also drop from columns passing axis=1 or axis="columns"
data.drop("b",axis=1)

             a   c   d
Ohio         0   2   3
Utah         4   6   7
Texas        8  10  11
California  12  14  15

In [117]:
data.drop(["b","d"],axis="columns")

             a   c
Ohio         0   2
Utah         4   6
Texas        8  10
California  12  14

In [118]:
data.drop(["Ohio","Utah"],axis=0)

             a   b   c   d
Texas        8   9  10  11
California  12  13  14  15

In [119]:
data.drop(["Ohio","Utah"],axis="index")

             a   b   c   d
Texas        8   9  10  11
California  12  13  14  15

### Indexing, Selection and Filtering

In [120]:
#Series indexing works as in Numpy, but you can use the series index values instead of only integers
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [121]:
obj['b']

1.0

In [122]:
obj[1]

1.0

In [123]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [124]:
obj[['a','c']]

a    0.0
c    2.0
dtype: float64

In [125]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [126]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [128]:
# when indexing with labels however the preferred way is by using the .loc operator:
# the loc operator only look in the index. While obj[[1,3]] always works, obj.loc[[1,3]] will fail, 
# unless there are labels defined with the integers 1 and 3.
obj.loc[['a','c']]

a    0.0
c    2.0
dtype: float64

In [129]:
obj.loc[[1,3]] # this will fail

KeyError: "None of [Int64Index([1, 3], dtype='int64')] are in the [index]"

In [130]:
obj1 = pd.Series([4,5,6], index=[1,2,3])
obj1

1    4
2    5
3    6
dtype: int64

In [132]:
obj1.loc[[1,3]] # this works, becaus the index is defined as numeric and contains both 1 and 3

1    4
3    6
dtype: int64

In [135]:
# to index using row numeric index one can use iloc
print(obj)
obj.iloc[[1,3]]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

b    1.0
d    3.0
dtype: float64

In [136]:
# you can also slice with labels, but in this case the endpoint is inclusive:
obj.loc['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [138]:
# indexing in dataframe
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=["Ohio","Utah","Texas","California"],columns= ["a","b","c","d"] )
data

             a   b   c   d
Ohio         0   1   2   3
Utah         4   5   6   7
Texas        8   9  10  11
California  12  13  14  15

In [139]:
data["b"]

Ohio           1
Utah           5
Texas          9
California    13
Name: b, dtype: int32

In [141]:
data[["d","b"]]

             d   b
Ohio         3   1
Utah         7   5
Texas       11   9
California  15  13

In [142]:
data[:2]

      a  b  c  d
Ohio  0  1  2  3
Utah  4  5  6  7

In [151]:
print(type(data.iloc[1]))
data.iloc[1]

<class 'pandas.core.series.Series'>

a    4
b    5
c    6
d    7
Name: Utah, dtype: int32

In [153]:
print(type(data.iloc[1:2]))
data.iloc[1:2]

<class 'pandas.core.frame.DataFrame'>

      a  b  c  d
Utah  4  5  6  7

In [154]:
data

             a   b   c   d
Ohio         0   1   2   3
Utah         4   5   6   7
Texas        8   9  10  11
California  12  13  14  15

In [155]:
data["c"]>5

Ohio          False
Utah           True
Texas          True
California     True
Name: c, dtype: bool

In [156]:
data[data["c"]>5]

             a   b   c   d
Utah         4   5   6   7
Texas        8   9  10  11
California  12  13  14  15

In [157]:
data <5

                a      b      c      d
Ohio         True   True   True   True
Utah         True  False  False  False
Texas       False  False  False  False
California  False  False  False  False

In [158]:
data[data<5]=0
data

             a   b   c   d
Ohio         0   0   0   0
Utah         0   5   6   7
Texas        8   9  10  11
California  12  13  14  15

In [159]:
# label based and integer based indexing

In [160]:
data.loc["California"] # select rows by label

a    12
b    13
c    14
d    15
Name: California, dtype: int32

In [165]:
data.loc[["Ohio","Utah"]] # select multiple rows by label

      a  b  c  d
Ohio  0  0  0  0
Utah  0  5  6  7

In [166]:
data.loc[:,"a"] # select a column by label

Ohio           0
Utah           0
Texas          8
California    12
Name: a, dtype: int32

In [167]:
data.loc['Utah',['a','b']]

a    0
b    5
Name: Utah, dtype: int32

In [168]:
data.loc[['Utah'],['a','b']]

      a  b
Utah  0  5

In [169]:
# similar selections using iloc
data.iloc[3]

a    12
b    13
c    14
d    15
Name: California, dtype: int32

In [170]:
data.iloc[[0,1]]

      a  b  c  d
Ohio  0  0  0  0
Utah  0  5  6  7

In [172]:
data.iloc[:,0]

Ohio           0
Utah           0
Texas          8
California    12
Name: a, dtype: int32

In [173]:
data.iloc[1,[0,1]]

a    0
b    5
Name: Utah, dtype: int32

In [174]:
data.iloc[[1],[0,1]]

      a  b
Utah  0  5

In [175]:
# both indexing functions support slicing
data.loc[:"Texas",'b']

Ohio     0
Utah     5
Texas    9
Name: b, dtype: int32

In [176]:
data.iloc[:,:3]

             a   b   c
Ohio         0   0   0
Utah         0   5   6
Texas        8   9  10
California  12  13  14

In [178]:
#the output of a selection can be further indexed. e.g.
data.iloc[:,:3][data['c']>=10]

             a   b   c
Texas        8   9  10
California  12  13  14

In [179]:
# Boolean arrays can be used with loc but not iloc:
data.loc[data.c >=2]

             a   b   c   d
Utah         0   5   6   7
Texas        8   9  10  11
California  12  13  14  15

In [182]:
# single elements can be extracted with .at (labels) or .iat (integer positions)
data.at['Utah','b']

5

In [187]:
data.iat[1, 2]

6

In [188]:
# assigning to a column or row by label or integer position:
data.loc[:,"a"] = 1
data

            a   b   c   d
Ohio        1   0   0   0
Utah        1   5   6   7
Texas       1   9  10  11
California  1  13  14  15

In [189]:
data.iloc[2] = 5
data

            a   b   c   d
Ohio        1   0   0   0
Utah        1   5   6   7
Texas       5   5   5   5
California  1  13  14  15

In [190]:
data.loc[data.d > 5] = 3
data

            a  b  c  d
Ohio        1  0  0  0
Utah        3  3  3  3
Texas       5  5  5  5
California  3  3  3  3

In [192]:
# chain operations can be tricky: this does not works and generates a warning
data.loc[data.c == 5]['c']=6

C:\Users\iiot2\AppData\Local\Temp\ipykernel_16748\3097803092.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.c == 5]['c']=6

In [193]:
# the original data are unchanged:
data

            a  b  c  d
Ohio        1  0  0  0
Utah        3  3  3  3
Texas       5  5  5  5
California  3  3  3  3

In [194]:
# the expected result can be achieved with direct indexing via .loc
data.loc[data.c ==5, ['c']] = 6

In [195]:
data

            a  b  c  d
Ohio        1  0  0  0
Utah        3  3  3  3
Texas       5  5  6  5
California  3  3  3  3

### Arithmetic and Data alignment
Pandas automatically handles indexes, aligning data in arithmetic operations:

In [196]:
s1 = pd.Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e',])

In [197]:
s2 = pd.Series([-2.1,3.6,-1.5,4.,3.1], index=['a','c','e','f','g'])

In [198]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [199]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [200]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

For DataFrame aligment is performed on both rows and columns

In [201]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), index=["Ohio","Texas","Colorado"],columns= list("bcd") )
df2 = pd.DataFrame(np.arange(12).reshape((4,3)), index=["Utah","Ohio","Texas","Oregon"],columns= list("bde") )

In [202]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [203]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [204]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### arithmetic methods with fill values

In [205]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns= list("abcd") )
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns= list("abcde") )

In [206]:
df2.loc[1,'b'] = np.nan

In [207]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [208]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [209]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [213]:
df1.add(df2, fill_value=0) # using the add method from DataFrame, it is possibile to specify a fill_value

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [214]:
# there are several flexible arithmetic methods
df1.add(df2,fill_value=0) # perform df1+df2

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [215]:
df1.radd(df2,fill_value=0) # reverse operation invert the order of operands: df2+df1

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [216]:
df1.sub(df2,fill_value=0) #performs d1-d2

      a     b     c     d     e
0   0.0   0.0   0.0   0.0  -4.0
1  -1.0   5.0  -1.0  -1.0  -9.0
2  -2.0  -2.0  -2.0  -2.0 -14.0
3 -15.0 -16.0 -17.0 -18.0 -19.0

In [217]:
df1.rsub(df2,fill_value=0) # reverse operation invert the order of operands: d2-d1

      a     b     c     d     e
0   0.0   0.0   0.0   0.0   4.0
1   1.0  -5.0   1.0   1.0   9.0
2   2.0   2.0   2.0   2.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [218]:
df1.div(df2,fill_value=1) # performs d1/d2

          a         b         c         d         e
0       NaN  1.000000  1.000000  1.000000  0.250000
1  0.800000  5.000000  0.857143  0.875000  0.111111
2  0.800000  0.818182  0.833333  0.846154  0.071429
3  0.066667  0.062500  0.058824  0.055556  0.052632

In [219]:
df1.rdiv(df2,fill_value=1) # performs d2/d1

       a          b          c          d     e
0    NaN   1.000000   1.000000   1.000000   4.0
1   1.25   0.200000   1.166667   1.142857   9.0
2   1.25   1.222222   1.200000   1.181818  14.0
3  15.00  16.000000  17.000000  18.000000  19.0

In [220]:
df1.floordiv(df2,fill_value=1) # performs floor(d1/d2)

     a    b    c    d    e
0  NaN  1.0  1.0  1.0  0.0
1  0.0  5.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0  0.0

In [221]:
df1.rfloordiv(df2,fill_value=1) # performs floor(d2/d1)

      a     b     c     d     e
0   NaN   1.0   1.0   1.0   4.0
1   1.0   0.0   1.0   1.0   9.0
2   1.0   1.0   1.0   1.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [223]:
df1.mul(df2,fill_value=0) # performs d1*d2

      a     b      c      d    e
0   0.0   1.0    4.0    9.0  0.0
1  20.0   0.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [224]:
df1.rmul(df2,fill_value=0) # performs d2*d1

      a     b      c      d    e
0   0.0   1.0    4.0    9.0  0.0
1  20.0   0.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [226]:
df1.pow(df2,fill_value=0) # performs d1^d2

              a             b             c             d    e
0  1.000000e+00  1.000000e+00  4.000000e+00  2.700000e+01  0.0
1  1.024000e+03  1.000000e+00  2.799360e+05  5.764801e+06  0.0
2  1.073742e+09  3.138106e+10  1.000000e+12  3.452271e+13  0.0
3  0.000000e+00  0.000000e+00  0.000000e+00  0.000000e+00  0.0

In [227]:
df1.rpow(df2,fill_value=1) # performs d2^d1

             a             b             c             d     e
0          1.0  1.000000e+00  4.000000e+00  2.700000e+01   4.0
1        625.0  1.000000e+00  1.176490e+05  2.097152e+06   9.0
2  100000000.0  2.357948e+09  6.191736e+10  1.792160e+12  14.0
3         15.0  1.600000e+01  1.700000e+01  1.800000e+01  19.0

### Operations between DataFrame and Series

In [228]:
# arithmetic between DF and Series is also defined. It works similar to numpy broadcasting

In [230]:
# Example of numpy broadcasting:
arr =np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [231]:
arr[0]

array([0., 1., 2., 3.])

In [232]:
arr - arr[0] # arr[0] is broadcasted along the rows, so that it can be subtracted to each row

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [234]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)), index=["Utah","Ohio","Texas","Oregon"],columns= list("bde") )
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [235]:
series = frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [236]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [237]:
series2 = pd.Series(np.arange(3), index=list('bef'))
series2

b    0
e    1
f    2
dtype: int32

In [238]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [239]:
# to broadcast over the columns, matching on the rows, use the arithmetic methods
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [240]:
frame.sub(series3, axis="index")

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### Function applications and mapping
Numpy ufuncs also works on pandas objects

In [241]:
frame = pd.DataFrame(np.random.standard_normal((4,3)), index=["Utah","Ohio","Texas","Oregon"],columns= list("bde") )
frame

               b         d         e
Utah    0.036323 -0.151035  0.343724
Ohio    0.645851 -0.340833 -1.769634
Texas   1.416320 -1.606012 -0.173123
Oregon -0.258784  0.761125  0.024588

In [242]:
np.abs(frame)

               b         d         e
Utah    0.036323  0.151035  0.343724
Ohio    0.645851  0.340833  1.769634
Texas   1.416320  1.606012  0.173123
Oregon  0.258784  0.761125  0.024588

In [245]:
# apply can be used to apply a function that extract one value from a series to either the rows or columns of a DataFrame
def f1(x):
    return x.max() - x.min()

frame.apply(f1) # by default apply works along rows, returning one value for each column

b    1.675104
d    2.367137
e    2.113358
dtype: float64

In [246]:
# the axis can be specified so that the function is called on values along columns, returning one value per row
frame.apply(f1, axis="columns")  # this is useful to generate new rows using values in the columns

Utah      0.494759
Ohio      2.415484
Texas     3.022332
Oregon    1.019909
dtype: float64

In [248]:
# many statistics however are already defined in the DataFrame object, so apply is not always necessary. Examples:
frame.mean(axis="columns")

Utah      0.076337
Ohio     -0.488206
Texas    -0.120938
Oregon    0.175643
dtype: float64

In [249]:
frame.sum(axis="columns") # equivalent to frame.sum(axis=1)

Utah      0.229012
Ohio     -1.464617
Texas    -0.362815
Oregon    0.526929
dtype: float64

In [250]:
frame.sum(axis="rows") # equivalent to frame.sum(axis=0)

b    1.839709
d   -1.336755
e   -1.574445
dtype: float64

In [253]:
frame.median(axis=1)

Utah      0.036323
Ohio     -0.340833
Texas    -0.173123
Oregon    0.024588
dtype: float64

In [254]:
frame.std(axis=1)

Utah      0.249795
Ohio      1.214467
Texas     1.511842
Oregon    0.526466
dtype: float64

In [255]:
frame.var(axis=1)

Utah      0.062397
Ohio      1.474930
Texas     2.285665
Oregon    0.277167
dtype: float64

In [256]:
# apply can also return a Series with multiple values, e.g.:
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

frame.apply(f2)

            b         d         e
min -0.258784 -1.606012 -1.769634
max  1.416320  0.761125  0.343724

In [257]:
frame.apply(f2,axis=1)

             min       max
Utah   -0.151035  0.343724
Ohio   -1.769634  0.645851
Texas  -1.606012  1.416320
Oregon -0.258784  0.761125

In [258]:
# element wise function can also be applied using applymap:
def my_format(x):
    return f"{x:.2f}"  # create a formatted string, representing x as a floating point with 2 decimals

frame.applymap(my_format)

            b      d      e
Utah     0.04  -0.15   0.34
Ohio     0.65  -0.34  -1.77
Texas    1.42  -1.61  -0.17
Oregon  -0.26   0.76   0.02

In [259]:
# the equivalent elentwise map for a Series is "map":
series1 = frame['b']
series1

Utah      0.036323
Ohio      0.645851
Texas     1.416320
Oregon   -0.258784
Name: b, dtype: float64

In [260]:
series1.map(my_format)

Utah       0.04
Ohio       0.65
Texas      1.42
Oregon    -0.26
Name: b, dtype: object

### Sorting and Ranking

In [261]:
# sort by index in a Series
obj = pd.Series(np.arange(4.), index=list("dabc"))
obj

d    0.0
a    1.0
b    2.0
c    3.0
dtype: float64

In [262]:
obj.sort_index()

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [265]:
obj = obj.sort_index()
obj

a    1.0
b    2.0
c    3.0
d    0.0
dtype: float64

In [268]:
# Sort by index in a DataFrame
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], columns=list("dabc"))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [269]:
frame.sort_index() # sort by default along rows index

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [271]:
frame.sort_index(axis=1) # equivalent to frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [272]:
frame.sort_index(axis=1, ascending=False) # sort in descending order

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [279]:
# sorting by Values in a Series
obj = pd.Series(np.arange(4.), index=list("dabc"))
obj = obj.sort_values()
obj

d    0.0
a    1.0
b    2.0
c    3.0
dtype: float64

In [274]:
# sort in a series handling missing values
obj = pd.Series([4,np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [276]:
obj.sort_values() # NaN by default are sorted at the end

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [277]:
obj.sort_values(na_position="first") # can be sorted at the beginnig

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [280]:
# Sort a DataFrame by values 
frame = pd.DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [281]:
# sort based on values in a column
frame.sort_values('b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [282]:
# sort based on values on multiple columns
frame.sort_values(['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### Summarizing and computing descriptive statistics

In [289]:
df = pd.DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3] ], index=list("abcd"), columns=["one","two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [290]:
df.sum() # sum along rows, skip nan considering them zero by default

one    9.25
two   -5.80
dtype: float64

In [291]:
df.sum(axis="columns") # sum along columns, skip nan considering them zero by default

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [292]:
df.sum(axis="rows",skipna=False)

one   NaN
two   NaN
dtype: float64

In [293]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [295]:
df.mean(axis=1) # mean requires at least a value to provide a result

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [297]:
df.idxmin() # return index of min value along the rows

one    d
two    b
dtype: object

In [298]:
df.idxmax(axis=1) #return index of max value along columns

a    one
b    one
c    NaN
d    one
dtype: object

In [299]:
df.cumsum() # compute cumulative sum along rows

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [301]:
df.describe() # provide metrics computed along rows

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

TypeError: describe() got an unexpected keyword argument 'axis'